// vim: ft=jsonc
// Please provide your info in your own .json file.
// See https://jscraftcamp.org/registration for more information
{
	// your real name (required by location host)
	"realName": {
		"givenName": "Dominik",
		"familyName": "Burgdörfer",
		// if you prefer to have your family name shown first (optional)
		"placeFamilyNameFirst": false,
		// if you do not want to show your family name on the participant list (optional)
		"hideFamilyNameOnWebsite": false
	},
	// please put in the account name of the PR creator, if you sign up somebody else
	"githubAccountName": "domachine",
	// company name (optional)
	"company": "eXXcellent solutions GmbH",
	// either both days or at least one day has to be set to true.
	// If you cannot make one of the days, please set it to false, to allow someone else take that spot!
	"when": {
		// June 27th, 2025
		"friday": true,
		// June 28th, 2025
		"saturday": true
	},
	// if you are willing to take session notes and publish them to github (required)
	"iCanTakeNotesDuringSessions": true,
	// your current interests (JS and in general) (required)
	"tags": ["Preact", "Node.js", "Express", "Vite", "TypeScript"],
	// if you only eat vegan food (optional)
	"vegan": true,
	// if you only eat vegan or vegetarian food (optional)
	"vegetarian": false,
	// tell us a few words how JavaScript affects you (required)
	"whatIsMyConnectionToJavascript": "I've been working with JavaScript professionally for 15+ years and it's a passion for me. I'm very into local first software and like challenging the possibilities of web technologies.",
	// what can you contribute to the bar camp (required)
	"whatCanIContribute": "I can provide insights into e2e testing strategies with external system components and local first software with sqlite",
	// if you want a T-Shirt we need your size and variant preference (optional)
	// the following sizes are available: S, M, L, XL, 2XL, 3XL (only regular cut)
	"tShirtSize": "S",
	// your Mastodon URL (optional)
	"mastodon": "https://fosstodon.org/@domachine",
	// your LinkedIn profile URL
	"linkedin": "https://de.linkedin.com/in/dominik-burgd%C3%B6rfer-53479b130"
}
