// vim: ft=jsonc
// Please provide your info in your own .json file.
// See https://jscraftcamp.org/registration for more information
{
	// your real name (required by location host)
	"realName": {
		"givenName": "Hamideh",
		"familyName": "Sheikh",
		// if you prefer to have your family name shown first (optional)
		"placeFamilyNameFirst": false,
		// if you do not want to show your family name on the participant list (optional)
		"hideFamilyNameOnWebsite": true
	},
	// please put in the account name of the PR creator, if you sign up somebody else
	"githubAccountName": "Hamideh-sheikh",
	// company name (optional)
	"company": "Finanzvergleich.com GmbH",
	// either both days or at least one day has to be set to true.
	// If you cannot make one of the days, please set it to false, to allow someone else take that spot!
	"when": {
		// June 27th, 2025
		"friday": true,
		// June 28th, 2025
		"saturday": false
	},
	// if you are willing to take session notes and publish them to github (required)
	"iCanTakeNotesDuringSessions": false,
	// your current interests (JS and in general) (required)
	"tags": ["TS", "React", "Zustand", "Next.js"],
	// if you only eat vegan food (optional)
	"vegan": false,
	// if you only eat vegan or vegetarian food (optional)
	"vegetarian": false,
	// what you cannot eat or drink (optional); If you don't want to put it in here, message the organizers.
	// IMPORTANT: we cannot guarantee that food for every diet will be available,
	//            if you have gluten free diet, please make backup plans.
	"allergies": [],
	// tell us a few words how JavaScript affects you (required)
	"whatIsMyConnectionToJavascript": "JavaScript is a key tool in my daily development work, enabling me to build responsive and dynamic web applications.",
	// what can you contribute to the bar camp (required)
	"whatCanIContribute": "I can share my expertise in TypeScript and React, and participate in discussions on modern web development trends.",
	// if you want a T-Shirt we need your size and variant preference (optional)
	// the following sizes are available: S, M, L, XL, 2XL, 3XL (only regular cut)
	"tShirtSize": "S",
	// your Mastodon URL (optional)
	"mastodon": "",
	// your LinkedIn profile URL
	"linkedin": "https://www.linkedin.com/in/hamideh-sheikh/",
	// your X (Twitter) handle - must match regex ^[a-zA-Z_]{1}[a-zA-Z0-9_]{0,14}$ (optional)
	"X": "",
	// your website URL or other social media (optional)
	"website": ""
}
